USE [grls];
GO

SET ANSI_NULLS ON;
GO
SET QUOTED_IDENTIFIER ON;
GO


BEGIN TRAN;

BEGIN TRY
	BEGIN -- backup
		DECLARE @tableName VARCHAR(100)
		SET @tableName = '[GrlsHistory].[grls].ResolutionTemplates_5105_'+REPLACE(REPLACE(REPLACE(CONVERT(varchar,GETDATE(), 120), '-', '_'), ' ', '_'), ':', '_');
		IF OBJECT_ID(@tableName) IS NULL BEGIN
			EXEC('SELECT * INTO '+@tableName+' FROM grls.dbo.ResolutionTemplates') 
		END
	END;

	DECLARE @DEFECT_STATEMENT_CODE VARCHAR(50) = 'mp_defect_reg_statement';
	DECLARE @defect_statement_type_id INT = (select top(1) [idStatementType] from [dbo].[StatementTypeList] where [StatementTypeCode] = @DEFECT_STATEMENT_CODE);
			
			
	DECLARE @TASK_KIND_EXPERTISE_QUALITY_CODE NVARCHAR(100) = 'task_mr_em_q_riskexp_req_exp';
	DECLARE @TASK_KIND_EXPERTISE_QUALITY_FORCE_CODE NVARCHAR(100) = 'task_mr_em_q_riskexp_req_exp_force';
	DECLARE @TASK_KIND_ETHICS_CODE NVARCHAR(100) = 'task_mr_em_etexp_req_exp';
	DECLARE @TASK_KIND_ETHICS_FORCE_CODE NVARCHAR(100) = 'task_mr_em_etexp_req_exp_force';


	DECLARE @templateId INT = NULL,
			@kindId INT = NULL,
			@kindCode NVARCHAR(100) = NULL;
			
	BEGIN -- ЭКфПР
		SET @kindCode = @TASK_KIND_EXPERTISE_QUALITY_CODE
		SET @templateId = (select top(1) [ResolutionTemplateId] 
						   from [dbo].[ResolutionKinds] 
						   where [Code] = @kindCode
							 and [StatementTypeId] = @defect_statement_type_id);
		IF @templateId IS NOT NULL
		BEGIN
			UPDATE [dbo].[ResolutionTemplates]
			SET [Name] = N'Задание на проведение экспертизы лекарственного средства для медицинского применения в части экспертизы качества лекарственного средства и экспертизы отношения ожидаемой пользы к возможному риску применения лекарственного препарата для медицинского применения',
				[Result] = N'       Министерством здравоохранения Российской Федерации в соответствии с постановлением Правительства РФ от 05.04.2022 № 593 "Об особенностях обращения лекарственных средств для медицинского применения в случае дефектуры или риска возникновения дефектуры лекарственных препаратов в связи с введением в отношении Российской Федерации ограничительных мер экономического характера" (далее – Постановление ) на основании представленного заявления № [idStatement] (вх. № [inNumber] от [inDate]) направляет на проведение экспертизы лекарственного средства для медицинского применения в части экспертизы качества лекарственного средства и экспертизы отношения ожидаемой пользы к возможному риску применения лекарственного препарата для медицинского применения:',
				[Additional] = N'       Обращаем внимание на то, что в соответствии с пунктом 16 Постановления срок проведения экспертизы качества лекарственного средства и экспертизы отношения ожидаемой пользы к возможному риску применения лекарственного препарата не превышает 50 рабочих дней.'
			WHERE [ResolutionTemplateID] = @templateId
		END;
	END
	BEGIN -- ЭКфПР (force)
		SET @kindCode = @TASK_KIND_EXPERTISE_QUALITY_FORCE_CODE
		SET @templateId = (select top(1) [ResolutionTemplateId] 
						   from [dbo].[ResolutionKinds] 
						   where [Code] = @kindCode
							 and [StatementTypeId] = @defect_statement_type_id);
		IF @templateId IS NOT NULL
		BEGIN
			UPDATE [dbo].[ResolutionTemplates]
			SET [Name] = N'Задание на проведение экспертизы лекарственного средства для медицинского применения в части экспертизы качества лекарственного средства и экспертизы отношения ожидаемой пользы к возможному риску применения лекарственного препарата для медицинского применения',
				[Result] = N'       Министерством здравоохранения Российской Федерации в соответствии с постановлением Правительства РФ от 05.04.2022 № 593 "Об особенностях обращения лекарственных средств для медицинского применения в случае дефектуры или риска возникновения дефектуры лекарственных препаратов в связи с введением в отношении Российской Федерации ограничительных мер экономического характера" (далее – Постановление ) на основании представленного заявления № [idStatement] (вх. № [inNumber] от [inDate]) направляет на проведение экспертизы лекарственного средства для медицинского применения в части экспертизы качества лекарственного средства и экспертизы отношения ожидаемой пользы к возможному риску применения лекарственного препарата для медицинского применения:',
				[Additional] = N'       Обращаем внимание на то, что в соответствии с пунктом 16 Постановления срок проведения экспертизы качества лекарственного средства и экспертизы отношения ожидаемой пользы к возможному риску применения лекарственного препарата не превышает 50 рабочих дней.'
			WHERE [ResolutionTemplateID] = @templateId
		END;
	END
	BEGIN -- ЭТ
		SET @kindCode = @TASK_KIND_ETHICS_CODE
		SET @templateId = (select top(1) [ResolutionTemplateId] 
						   from [dbo].[ResolutionKinds] 
						   where [Code] = @kindCode
							 and [StatementTypeId] = @defect_statement_type_id);
		IF @templateId IS NOT NULL
		BEGIN
			UPDATE [dbo].[ResolutionTemplates]
			SET [Name] = N'Задание на проведение этической экспертизы документов, связанных с установлением возможности государственной регистрации лекарственного препарата, который предназначен для применения в случае дефектуры или риска возникновения дефектуры лекарственных препаратов',
				[Result] = N'       Министерство здравоохранения Российской Федерации в соответствии с постановлением Правительства Российской Федерации от 05.04.2022 № 593 "Об особенностях обращения лекарственных средств для медицинского применения в случае дефектуры или риска возникновения дефектуры лекарственных препаратов в связи с введением в отношении Российской Федерации ограничительных мер экономического характера" (далее – Постановление) на основании представленного заявления № [idStatement] (вх. № [inNumber] от [inDate]) направляет на проведение этической экспертизы документы, связанные с установлением возможности государственной регистрации лекарственного препарата, который предназначен для применения в случае дефектуры или риска возникновения дефектуры лекарственных препаратов:',
				[Additional] = N'       Доступ к документам, связанным с установлением возможности государственной регистрации лекарственного препарата, который предназначен для применения в случае дефектуры или риска возникновения дефектуры лекарственных препаратов в связи с Постановлением, представлен членам Совета по этике посредством авторизованного доступа на официальном сайте Минздрава России в сети «Интернет» по адресу: https://grls.rosminzdrav.ru/.'
			WHERE [ResolutionTemplateID] = @templateId
		END;
	END
	BEGIN -- ЭТ (force)
		SET @kindCode = @TASK_KIND_ETHICS_FORCE_CODE
		SET @templateId = (select top(1) [ResolutionTemplateId] 
						   from [dbo].[ResolutionKinds] 
						   where [Code] = @kindCode
							 and [StatementTypeId] = @defect_statement_type_id);
		IF @templateId IS NOT NULL
		BEGIN
			UPDATE [dbo].[ResolutionTemplates]
			SET [Name] = N'Задание на проведение этической экспертизы документов, связанных с установлением возможности государственной регистрации лекарственного препарата, который предназначен для применения в случае дефектуры или риска возникновения дефектуры лекарственных препаратов',
				[Result] = N'       Министерство здравоохранения Российской Федерации в соответствии с постановлением Правительства Российской Федерации от 05.04.2022 № 593 "Об особенностях обращения лекарственных средств для медицинского применения в случае дефектуры или риска возникновения дефектуры лекарственных препаратов в связи с введением в отношении Российской Федерации ограничительных мер экономического характера" (далее – Постановление) на основании представленного заявления № [idStatement] (вх. № [inNumber] от [inDate]) направляет на проведение этической экспертизы документы, связанные с установлением возможности государственной регистрации лекарственного препарата, который предназначен для применения в случае дефектуры или риска возникновения дефектуры лекарственных препаратов:',
				[Additional] = N'       Доступ к документам, связанным с установлением возможности государственной регистрации лекарственного препарата, который предназначен для применения в случае дефектуры или риска возникновения дефектуры лекарственных препаратов в связи с Постановлением, представлен членам Совета по этике посредством авторизованного доступа на официальном сайте Минздрава России в сети «Интернет» по адресу: https://grls.rosminzdrav.ru/.'
			WHERE [ResolutionTemplateID] = @templateId
		END;
	END

	COMMIT TRAN;
END TRY
BEGIN CATCH

	ROLLBACK TRAN;
END CATCH
